In [2]:
import numpy as np 
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}

df = pd.DataFrame(data)

In [4]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [7]:

data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

df2 = pd.DataFrame(data_list)
columns = ["Name","age","city","salary"]
df2 = pd.DataFrame(data_list,columns = columns)
df2

    Name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [9]:
# selection and indexing of columns 
df2[["Name","city"]]

    Name      city
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [10]:
# creating a new columns 
df2["designation"] = ["doctor","eng","doctor","eng"]
df2

    Name  age      city  salary designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000         eng
2  Peter   29    Berlin   62000      doctor
3  Linda   42    London   85000         eng

In [11]:
# removing a columns 
df2.drop(0,axis=0)

    Name  age    city  salary designation
1   Anna   34   Paris   70000         eng
2  Peter   29  Berlin   62000      doctor
3  Linda   42  London   85000         eng

In [12]:
# selecting rows 

df2.loc[[0,1]]

   Name  age      city  salary designation
0  John   28  New York   65000      doctor
1  Anna   34     Paris   70000         eng

In [13]:
df2.iloc[3]

Name            Linda
age                42
city           London
salary          85000
designation       eng
Name: 3, dtype: object

In [17]:
df2

    Name  age      city  salary designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000         eng
2  Peter   29    Berlin   62000      doctor
3  Linda   42    London   85000         eng

In [18]:
# i only want people whose age is above 30

df2[df2["age"]>30]

    Name  age    city  salary designation
1   Anna   34   Paris   70000         eng
3  Linda   42  London   85000         eng

In [20]:
#  i only want people whose age is above 30 and their city must be paris 

df2[(df2["age"]>30)&(df2["city"] == "Paris")]

   Name  age   city  salary designation
1  Anna   34  Paris   70000         eng